In [301]:
#import libraries
import pandas as pd
import numpy as np

In [302]:
#our messy sample dataset
data = {
    "EmpID": [101, 102, "103", 104, 105, 106, None, 108, 109, 110],
    "fullName": [
        " Alice Johnson ", "MICHEAL smith", "sarah lee", "David-Kim", None, "john brown", 
        "Emma Wilson", "TOM  davis", "Jane Miller", "Chris taylor"
    ],
    "Dept": ["IT", "hr", "Mktng", "IT", "finance", "marketing", "Finance", None, "HR", "marketing"],
    "Age": [29, "thirty-five", 26, 31, 42, 27, 33, 30, None, 28],
    "Salary($)": ["$5500.50", "4800", "4200.75", "NaN", "6100", "4,300", "5800", "5000", "4700.0", "4400"],
    "JoinDate": [
        "2021/04/12", "2020/11/01", "2022/01/18", "2019/9/25", "2018/07/05", 
        "2021/10/14", "2019/12/01", "2020/03/22", "2021/05/10", "2022/02/05"
    ],
    "Performance": [87, "73", 90, 65, 82, 75, 88, None, "79%", "91"],
    "Remote?": ["Yes", "No", "Y", "N", "yes", "no", "Y", "Yes", None, "True"]
}

#create the dataframe
df = pd.DataFrame(data)

#display dataframe
df

,EmpID,fullName,Dept,Age,Salary($),JoinDate,Performance,Remote?
0,101,Alice Johnson,IT,29,$5500.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020/11/01,73,No
2,103,sarah lee,Mktng,26,4200.75,2022/01/18,90,Y
3,104,David-Kim,IT,31,NaN,2019/9/25,65,N
4,105,None,finance,42,6100,2018/07/05,82,yes
5,106,john brown,marketing,27,"4,300",2021/10/14,75,no
6,None,Emma Wilson,Finance,33,5800,2019/12/01,88,Y
7,108,TOM davis,None,30,5000,2020/03/22,None,Yes
8,109,Jane Miller,HR,None,4700.0,2021/05/10,79%,None
9,110,Chris taylor,marketing,28,4400,2022/02/05,91,True

In [303]:
#get the shapes of the data
df.shape

(10, 8)

In [304]:
#infomation of the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmpID        9 non-null      object
 1   fullName     9 non-null      object
 2   Dept         9 non-null      object
 3   Age          9 non-null      object
 4   Salary($)    10 non-null     object
 5   JoinDate     10 non-null     object
 6   Performance  9 non-null      object
 7   Remote?      9 non-null      object
dtypes: object(8)
memory usage: 768.0+ bytes

In [305]:
#get the first five rows of the dataset
df.head()

,EmpID,fullName,Dept,Age,Salary($),JoinDate,Performance,Remote?
0,101,Alice Johnson,IT,29,$5500.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020/11/01,73,No
2,103,sarah lee,Mktng,26,4200.75,2022/01/18,90,Y
3,104,David-Kim,IT,31,NaN,2019/9/25,65,N
4,105,None,finance,42,6100,2018/07/05,82,yes

In [306]:
#get the columns names
df.columns

Index(['EmpID', 'fullName', 'Dept', 'Age', 'Salary($)', 'JoinDate',
       'Performance', 'Remote?'],
      dtype='object')

In [307]:
df.isnull().sum()

EmpID          1
fullName       1
Dept           1
Age            1
Salary($)      0
JoinDate       0
Performance    1
Remote?        1
dtype: int64

In [308]:
#inspect the dataset
print(df["Dept"].unique())
print(df["Remote?"].unique())
print(df["Age"].unique())

['IT' 'hr' 'Mktng' 'finance' 'marketing' 'Finance' None 'HR']
['Yes' 'No' 'Y' 'N' 'yes' 'no' None 'True']
[29 'thirty-five' 26 31 42 27 33 30 None 28]

In [309]:
#inspect salary column
df["Salary($)"].head(10)

0    $5500.50
1        4800
2     4200.75
3         NaN
4        6100
5       4,300
6        5800
7        5000
8      4700.0
9        4400
Name: Salary($), dtype: object

In [310]:
#inspect for JoinDate column
df["JoinDate"].tolist()

['2021/04/12',
 '2020/11/01',
 '2022/01/18',
 '2019/9/25',
 '2018/07/05',
 '2021/10/14',
 '2019/12/01',
 '2020/03/22',
 '2021/05/10',
 '2022/02/05']

In [311]:
#inspect for EmpID, fullName, and performance
df["Performance"].tolist()

[87, '73', 90, 65, 82, 75, 88, None, '79%', '91']

In [312]:
df["fullName"].tolist()

[' Alice Johnson ',
 'MICHEAL smith',
 'sarah lee',
 'David-Kim',
 None,
 'john brown',
 'Emma Wilson',
 'TOM  davis',
 'Jane Miller',
 'Chris taylor']

In [313]:
df["EmpID"].tolist()

[101, 102, '103', 104, 105, 106, None, 108, 109, 110]

In [314]:
#start cleaning the dataset
#rename columns heads
df.rename(columns={
    "EmpID": "emp_id",
    "fullName": "full_name",
    "Dept": "department",
    "Age": "age",
    "Salary($)": "salary",
    "JoinDate": "join_date",
    "Performance": "performance",
    "Remote?": "remote"
}, inplace=True)

df

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101,Alice Johnson,IT,29,$5500.50,2021/04/12,87,Yes
1,102,MICHEAL smith,hr,thirty-five,4800,2020/11/01,73,No
2,103,sarah lee,Mktng,26,4200.75,2022/01/18,90,Y
3,104,David-Kim,IT,31,NaN,2019/9/25,65,N
4,105,None,finance,42,6100,2018/07/05,82,yes
5,106,john brown,marketing,27,"4,300",2021/10/14,75,no
6,None,Emma Wilson,Finance,33,5800,2019/12/01,88,Y
7,108,TOM davis,None,30,5000,2020/03/22,None,Yes
8,109,Jane Miller,HR,None,4700.0,2021/05/10,79%,None
9,110,Chris taylor,marketing,28,4400,2022/02/05,91,True

In [315]:
#cleaning inconsistent values on fullname
df["full_name"] = df["full_name"].str.strip()
df["full_name"] = df["full_name"].str.title()
df["full_name"] = df["full_name"].str.replace(r"\s+", " ", regex=True)
df["full_name"] = df["full_name"].str.replace("-", " ")

df["full_name"]

0    Alice Johnson
1    Micheal Smith
2        Sarah Lee
3        David Kim
4             None
5       John Brown
6      Emma Wilson
7        Tom Davis
8      Jane Miller
9     Chris Taylor
Name: full_name, dtype: object

In [316]:
#clean inconsistent dataa from the department
#rename misspell word and abbreviation
df["department"].replace({
    "It": "IT",
    "hr": "HR",
    "Mktng": "Marketing",
    "finance": "Finance",
    "marketing": "Marketing",
}, inplace=True)
df["department"]

C:\Users\ola-dev\AppData\Local\Temp\ipykernel_3236\690215533.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["department"].replace({

0           IT
1           HR
2    Marketing
3           IT
4      Finance
5    Marketing
6      Finance
7         None
8           HR
9    Marketing
Name: department, dtype: object

In [317]:
#clean inconsistent age column
def clean_age(value):
    if value == "thirty-five":
        return 35
    elif isinstance(value, (int, float)):
        return value
    else:
        np.nan
df["age"] = df["age"].apply(clean_age)
df["age"]

0    29.0
1    35.0
2    26.0
3    31.0
4    42.0
5    27.0
6    33.0
7    30.0
8     NaN
9    28.0
Name: age, dtype: float64

In [318]:
#clean inconsistent values on salary column
df["salary"] = (
    df["salary"]
    .astype(str)
    .replace(r"[$,]", "", regex=True)
    .replace("NaN", np.nan)
    .astype(float)
)
df["salary"]

0    5500.50
1    4800.00
2    4200.75
3        NaN
4    6100.00
5    4300.00
6    5800.00
7    5000.00
8    4700.00
9    4400.00
Name: salary, dtype: float64

In [319]:
#clean the joindate column
df["join_date"] = pd.to_datetime(df["join_date"], errors="coerce")
df["join_date"]

0   2021-04-12
1   2020-11-01
2   2022-01-18
3   2019-09-25
4   2018-07-05
5   2021-10-14
6   2019-12-01
7   2020-03-22
8   2021-05-10
9   2022-02-05
Name: join_date, dtype: datetime64[ns]

In [320]:
#clean the performance column
df["performance"] = (
    df["performance"]
    .astype(str)
    .str.replace("%", "", regex=False)
    .replace("None", np.nan)
    .astype(float)
)
df["performance"]

0    87.0
1    73.0
2    90.0
3    65.0
4    82.0
5    75.0
6    88.0
7     NaN
8    79.0
9    91.0
Name: performance, dtype: float64

In [322]:
#clean remote column
df["remote"].replace({
    "yes": "Yes",
    "no": "No",
    "y": "Yes",
    "n": "No",
    "Y": "Yes",
    "N": "No",
    None: np.nan,
    "True": "Yes"
}, inplace=True)
df["remote"]

0    Yes
1     No
2    Yes
3     No
4    Yes
5     No
6    Yes
7    Yes
8    NaN
9    Yes
Name: remote, dtype: object

In [298]:
#clean the empid
df["emp_id"] = pd.to_numeric(df["emp_id"], errors="coerce")
df["emp_id"]

0    101.0
1    102.0
2    103.0
3    104.0
4    105.0
5    106.0
6      NaN
7    108.0
8    109.0
9    110.0
Name: emp_id, dtype: float64

In [299]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   emp_id       9 non-null      float64
 1   full_name    9 non-null      object
 2   department   9 non-null      object
 3   age          9 non-null      float64
 4   salary       9 non-null      float64
 5   join_date    10 non-null     datetime64[ns]
 6   performance  9 non-null      float64
 7   remote       9 non-null      object
dtypes: datetime64[ns](1), float64(4), object(3)
memory usage: 768.0+ bytes

In [300]:
df.head()

,emp_id,full_name,department,age,salary,join_date,performance,remote
0,101.0,Alice Johnson,IT,29.0,5500.50,2021-04-12,87.0,Yes
1,102.0,Micheal Smith,HR,35.0,4800.00,2020-11-01,73.0,No
2,103.0,Sarah Lee,Marketing,26.0,4200.75,2022-01-18,90.0,Yes
3,104.0,David Kim,IT,31.0,NaN,2019-09-25,65.0,No
4,105.0,None,Finance,42.0,6100.00,2018-07-05,82.0,Yes